## Лабораторная работа № 2. Библиотека Pandas
### (Валяев Георгий, ПИ20-6)

In [1]:
import pandas as pd
import numpy as np

##### 1. Получить файл набора данных, прилагающийся к этой работе.
##### 2. Считать файл в pandas DataFrame.

In [2]:
dataframe = pd.read_csv("data/train.csv", delimiter=',')
dataframe

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

##### 3. Ознакомиться с основными параметрами датасета, используя функции библиотеки pandas, включая следующие данные:
* Количество точек данных (измерений) в наборе
* Количество полей данных (атрибутов)
* Тип данных каждого поля, шкала каждого поля
* Количество отсутствующих значений для каждого поля
* Количество и названия константных и уникальных полей

In [3]:
print(f"Количество точек данных в наборе: {len(dataframe.shape)}")
print(f"Количество полей данных (атрибутов): \n1) {dataframe.shape[0]}\n2) {dataframe.shape[1]}")

Количество точек данных в наборе: 2
Количество полей данных (атрибутов):
1) 891
2) 12

In [4]:
print("Типы всех признаков со шкалами данных в наборе:")
data_scale = pd.concat([dataframe.dtypes, dataframe.apply(lambda item: item.unique())], axis=1)
data_scale.columns = np.array(["type_data", "scale_data"])
data_scale

Типы всех признаков со шкалами данных в наборе:

            type_data                                         scale_data
PassengerId     int64  [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14...
Survived        int64                                             [0, 1]
Pclass          int64                                          [3, 1, 2]
Name           object  [Braund, Mr. Owen Harris, Cumings, Mrs. John B...
Sex            object                                     [male, female]
Age           float64  [22.0, 38.0, 26.0, 35.0, nan, 54.0, 2.0, 27.0,...
SibSp           int64                              [1, 0, 3, 4, 2, 5, 8]
Parch           int64                              [0, 1, 2, 5, 3, 4, 6]
Ticket         object  [A/5 21171, PC 17599, STON/O2. 3101282, 113803...
Fare          float64  [7.25, 71.2833, 7.925, 53.1, 8.05, 8.4583, 51....
Cabin          object  [nan, C85, C123, E46, G6, C103, D56, A6, C23 C...
Embarked       object                                     [S, C, Q, nan]

In [5]:
print("Количество отсутствующих значений для каждого поля:")
dataframe.isna().sum()

Количество отсутствующих значений для каждого поля:

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [31]:
print("Количество и названия константных полей:")
constant_areas = [print(f'{column} => {len(dataframe[column]) - len(dataframe[column].unique()) == 0}') for column in dataframe.columns]

Количество и названия константных полей:
PassengerId => True
Survived => False
Pclass => False
Name => True
Sex => False
Age => False
SibSp => False
Parch => False
Ticket => False
Fare => False
Cabin => False
Embarked => False

In [14]:
print("Количество и названия уникальных полей:")
dataframe.nunique()

Количество и названия уникальных полей:

PassengerId    891
Survived         2
Pclass           3
Name           891
Sex              2
Age             88
SibSp            7
Parch            7
Ticket         681
Fare           248
Cabin          147
Embarked         3
dtype: int64

##### 4. Удалить из набора поля, не несущие информативной нагрузки - содержащие уникальные либо константные значения.

In [59]:
dataframe_clear = pd.DataFrame(dataframe)
dataframe_clear.drop(columns=["PassengerId", "Name", "Ticket", "Cabin", "Fare"], axis=1, inplace=True)
dataframe_clear

     Survived  Pclass     Sex   Age  SibSp  Parch Embarked
0           0       3    male  22.0      1      0        S
1           1       1  female  38.0      1      0        C
2           1       3  female  26.0      0      0        S
3           1       1  female  35.0      1      0        S
4           0       3    male  35.0      0      0        S
..        ...     ...     ...   ...    ...    ...      ...
886         0       2    male  27.0      0      0        S
887         1       1  female  19.0      0      0        S
888         0       3  female   NaN      1      2        S
889         1       1    male  26.0      0      0        C
890         0       3    male  32.0      0      0        Q

[891 rows x 7 columns]

##### 5. Заменить возраст пассажиров на год рождения.

In [60]:
dataframe_clear['Birth_Year'] = (1912 - dataframe_clear['Age'])
dataframe_clear

     Survived  Pclass     Sex   Age  SibSp  Parch Embarked  Birth_Year
0           0       3    male  22.0      1      0        S      1890.0
1           1       1  female  38.0      1      0        C      1874.0
2           1       3  female  26.0      0      0        S      1886.0
3           1       1  female  35.0      1      0        S      1877.0
4           0       3    male  35.0      0      0        S      1877.0
..        ...     ...     ...   ...    ...    ...      ...         ...
886         0       2    male  27.0      0      0        S      1885.0
887         1       1  female  19.0      0      0        S      1893.0
888         0       3  female   NaN      1      2        S         NaN
889         1       1    male  26.0      0      0        C      1886.0
890         0       3    male  32.0      0      0        Q      1880.0

[891 rows x 8 columns]

##### 6. Переименовать все названия колонок на русском языке.

In [38]:
rus_columns = {
    "PClass": "Класс пассажира",
    "Birth_Year": "Год рождения",
    "Sex": "Пол",
    "Survived": "Выживший",
    "Embarked" : "Порт посадки",
    "Pclass":"Класс пассажира",
    "SibSp": "Кол-во родственников 2 порядка",
    "Parch": "Кол-во родственников 1 порядка",
    "Age":"Возраст"
}
dataframe_clear = dataframe_clear.rename(columns=rus_columns)
dataframe_clear

,Выживший,Класс пассажира,Пол,Возраст,Кол-во родственников 2 порядка,Кол-во родственников 1 порядка,Порт посадки,Год рождения
0,0,3,male,22.0,1,0,S,1890.0
1,1,1,female,38.0,1,0,C,1874.0
2,1,3,female,26.0,0,0,S,1886.0
3,1,1,female,35.0,1,0,S,1877.0
4,0,3,male,35.0,0,0,S,1877.0
...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,S,1885.0
887,1,1,female,19.0,0,0,S,1893.0
888,0,3,female,NaN,1,2,S,NaN
889,1,1,male,26.0,0,0,C,1886.0
890,0,3,male,32.0,0,0,Q,1880.0

##### 7. Заменить все отсутствующие данные средним значением (в случае числового поля) либо самым распространенным в категориальных полях.

In [39]:
dataframe_clear.isna().sum()

Выживший                            0
Класс пассажира                     0
Пол                                 0
Возраст                           177
Кол-во родственников 2 порядка      0
Кол-во родственников 1 порядка      0
Порт посадки                        2
Год рождения                      177
dtype: int64

In [40]:
dataframe_clear['Класс пассажира'] = dataframe_clear['Класс пассажира'].fillna(dataframe_clear['Класс пассажира'].mode().item())
dataframe_clear['Год рождения'] = dataframe_clear['Год рождения'].fillna(dataframe_clear['Год рождения'].mode().item())
dataframe_clear['Порт посадки'] = dataframe_clear['Год рождения'].fillna(dataframe_clear['Порт посадки'].mode().item())
dataframe_clear['Возраст'] = dataframe_clear['Возраст'].fillna(dataframe_clear['Возраст'].mean().item())
dataframe_clear.isna().sum()

Выживший                          0
Класс пассажира                   0
Пол                               0
Возраст                           0
Кол-во родственников 2 порядка    0
Кол-во родственников 1 порядка    0
Порт посадки                      0
Год рождения                      0
dtype: int64

##### 8. Сохранить получившийся набор данных в формате CSV.

In [61]:
dataframe_clear.to_csv('final_dataframe.csv')

##### 9. Открыть данный файл в программе Microsoft Excel и сохранить в формате .xlsx.

In [44]:
import os

# открытие файла
os.startfile('final_dataframe.csv')

##### Ручное открытие файла и адаптация к расширению .xlsx.

In [56]:
os.startfile('final_dataframe.xlsx')

##### 10. Считать файл .xlsx в новый DataFrame.

In [62]:
excel_dataframe = pd.read_excel('final_dataframe.xlsx')
excel_df = pd.DataFrame(excel_dataframe)
excel_df

,Unnamed: 0,Survived,Pclass,Sex,Age,SibSp,Parch,Embarked,Birth_Year
0,0,0,3,male,22.0,1,0,S,1890.0
1,1,1,1,female,38.0,1,0,C,1874.0
2,2,1,3,female,26.0,0,0,S,1886.0
3,3,1,1,female,35.0,1,0,S,1877.0
4,4,0,3,male,35.0,0,0,S,1877.0
...,...,...,...,...,...,...,...,...,...
886,886,0,2,male,27.0,0,0,S,1885.0
887,887,1,1,female,19.0,0,0,S,1893.0
888,888,0,3,female,NaN,1,2,S,NaN
889,889,1,1,male,26.0,0,0,C,1886.0
890,890,0,3,male,32.0,0,0,Q,1880.0